app/controllers/tasks_controller.rb

  def create
   @task= Task.new(params[:task])
     if @task.save
---
INSERT INTO "tasks" ("created_at", "description", "priority", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 18 May 2012 20:54:39 UTC +00:00], ["description", "aaaa corre!!!"], ["priority", 10], ["updated_at", Fri, 18 May 2012 20:54:39 UTC +00:00]]

  def update
   @task=Task.find(params[:id])
   @task.update_attributes(params[:task])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "tasks" SET "description" = 'hola mundo', "updated_at" = '2012-05-21 15:25:31.990457' WHERE "tasks"."id" = 1

  def destroy
    Task.find(params[:id]).try(:delete)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "2"]]